OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic16/libdev/pic18f96j99.c
/*
 * This definitions of the PIC18F96J99 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:23:41 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#include <pic18f96j99.h>

//==============================================================================

__at(0x0DFF) __sfr UEP0;
__at(0x0DFF) volatile __UEP0bits_t UEP0bits;

__at(0x0E00) __sfr UEP1;
__at(0x0E00) volatile __UEP1bits_t UEP1bits;

__at(0x0E01) __sfr UEP2;
__at(0x0E01) volatile __UEP2bits_t UEP2bits;

__at(0x0E02) __sfr UEP3;
__at(0x0E02) volatile __UEP3bits_t UEP3bits;

__at(0x0E03) __sfr UEP4;
__at(0x0E03) volatile __UEP4bits_t UEP4bits;

__at(0x0E04) __sfr UEP5;
__at(0x0E04) volatile __UEP5bits_t UEP5bits;

__at(0x0E05) __sfr UEP6;
__at(0x0E05) volatile __UEP6bits_t UEP6bits;

__at(0x0E06) __sfr UEP7;
__at(0x0E06) volatile __UEP7bits_t UEP7bits;

__at(0x0E07) __sfr UEP8;
__at(0x0E07) volatile __UEP8bits_t UEP8bits;

__at(0x0E08) __sfr UEP9;
__at(0x0E08) volatile __UEP9bits_t UEP9bits;

__at(0x0E09) __sfr UEP10;
__at(0x0E09) volatile __UEP10bits_t UEP10bits;

__at(0x0E0A) __sfr UEP11;
__at(0x0E0A) volatile __UEP11bits_t UEP11bits;

__at(0x0E0B) __sfr UEP12;
__at(0x0E0B) volatile __UEP12bits_t UEP12bits;

__at(0x0E0C) __sfr UEP13;
__at(0x0E0C) volatile __UEP13bits_t UEP13bits;

__at(0x0E0D) __sfr UEP14;
__at(0x0E0D) volatile __UEP14bits_t UEP14bits;

__at(0x0E0E) __sfr UEP15;
__at(0x0E0E) volatile __UEP15bits_t UEP15bits;

__at(0x0E0F) __sfr UEIE;
__at(0x0E0F) volatile __UEIEbits_t UEIEbits;

__at(0x0E10) __sfr UIE;
__at(0x0E10) volatile __UIEbits_t UIEbits;

__at(0x0E11) __sfr UCFG;
__at(0x0E11) volatile __UCFGbits_t UCFGbits;

__at(0x0E12) __sfr RPOR0_1;
__at(0x0E12) volatile __RPOR0_1bits_t RPOR0_1bits;

__at(0x0E13) __sfr RPOR2_3;
__at(0x0E13) volatile __RPOR2_3bits_t RPOR2_3bits;

__at(0x0E14) __sfr RPOR4_5;
__at(0x0E14) volatile __RPOR4_5bits_t RPOR4_5bits;

__at(0x0E15) __sfr RPOR6_7;
__at(0x0E15) volatile __RPOR6_7bits_t RPOR6_7bits;

__at(0x0E16) __sfr RPOR8_9;
__at(0x0E16) volatile __RPOR8_9bits_t RPOR8_9bits;

__at(0x0E17) __sfr RPOR10_11;
__at(0x0E17) volatile __RPOR10_11bits_t RPOR10_11bits;

__at(0x0E18) __sfr RPOR12_13;
__at(0x0E18) volatile __RPOR12_13bits_t RPOR12_13bits;

__at(0x0E19) __sfr RPOR14_15;
__at(0x0E19) volatile __RPOR14_15bits_t RPOR14_15bits;

__at(0x0E1A) __sfr RPOR16_17;
__at(0x0E1A) volatile __RPOR16_17bits_t RPOR16_17bits;

__at(0x0E1B) __sfr RPOR18_19;
__at(0x0E1B) volatile __RPOR18_19bits_t RPOR18_19bits;

__at(0x0E1C) __sfr RPOR20_21;
__at(0x0E1C) volatile __RPOR20_21bits_t RPOR20_21bits;

__at(0x0E1D) __sfr RPOR22_23;
__at(0x0E1D) volatile __RPOR22_23bits_t RPOR22_23bits;

__at(0x0E1E) __sfr RPOR24_25;
__at(0x0E1E) volatile __RPOR24_25bits_t RPOR24_25bits;

__at(0x0E1F) __sfr RPOR26_27;
__at(0x0E1F) volatile __RPOR26_27bits_t RPOR26_27bits;

__at(0x0E20) __sfr RPOR28_29;
__at(0x0E20) volatile __RPOR28_29bits_t RPOR28_29bits;

__at(0x0E21) __sfr RPOR30_31;
__at(0x0E21) volatile __RPOR30_31bits_t RPOR30_31bits;

__at(0x0E22) __sfr RPOR32_33;
__at(0x0E22) volatile __RPOR32_33bits_t RPOR32_33bits;

__at(0x0E23) __sfr RPOR34_35;
__at(0x0E23) volatile __RPOR34_35bits_t RPOR34_35bits;

__at(0x0E24) __sfr RPOR36_37;
__at(0x0E24) volatile __RPOR36_37bits_t RPOR36_37bits;

__at(0x0E25) __sfr RPOR38_39;
__at(0x0E25) volatile __RPOR38_39bits_t RPOR38_39bits;

__at(0x0E26) __sfr RPOR40_41;
__at(0x0E26) volatile __RPOR40_41bits_t RPOR40_41bits;

__at(0x0E27) __sfr RPOR42_43;
__at(0x0E27) volatile __RPOR42_43bits_t RPOR42_43bits;

__at(0x0E28) __sfr RPOR44_45;
__at(0x0E28) volatile __RPOR44_45bits_t RPOR44_45bits;

__at(0x0E29) __sfr RPOR46;
__at(0x0E29) volatile __RPOR46bits_t RPOR46bits;

__at(0x0E2A) __sfr RPINR0_1;
__at(0x0E2A) volatile __RPINR0_1bits_t RPINR0_1bits;

__at(0x0E2B) __sfr RPINR2_3;
__at(0x0E2B) volatile __RPINR2_3bits_t RPINR2_3bits;

__at(0x0E2C) __sfr RPINR4_5;
__at(0x0E2C) volatile __RPINR4_5bits_t RPINR4_5bits;

__at(0x0E2D) __sfr RPINR6_7;
__at(0x0E2D) volatile __RPINR6_7bits_t RPINR6_7bits;

__at(0x0E2E) __sfr RPINR8_9;
__at(0x0E2E) volatile __RPINR8_9bits_t RPINR8_9bits;

__at(0x0E2F) __sfr RPINR10_11;
__at(0x0E2F) volatile __RPINR10_11bits_t RPINR10_11bits;

__at(0x0E30) __sfr RPINR12_13;
__at(0x0E30) volatile __RPINR12_13bits_t RPINR12_13bits;

__at(0x0E31) __sfr RPINR14_15;
__at(0x0E31) volatile __RPINR14_15bits_t RPINR14_15bits;

__at(0x0E32) __sfr RPINR16_17;
__at(0x0E32) volatile __RPINR16_17bits_t RPINR16_17bits;

__at(0x0E33) __sfr RPINR18_19;
__at(0x0E33) volatile __RPINR18_19bits_t RPINR18_19bits;

__at(0x0E34) __sfr RPINR20_21;
__at(0x0E34) volatile __RPINR20_21bits_t RPINR20_21bits;

__at(0x0E35) __sfr RPINR22_23;
__at(0x0E35) volatile __RPINR22_23bits_t RPINR22_23bits;

__at(0x0E36) __sfr RPINR24_25;
__at(0x0E36) volatile __RPINR24_25bits_t RPINR24_25bits;

__at(0x0E37) __sfr RPINR26_27;
__at(0x0E37) volatile __RPINR26_27bits_t RPINR26_27bits;

__at(0x0E38) __sfr RPINR28_29;
__at(0x0E38) volatile __RPINR28_29bits_t RPINR28_29bits;

__at(0x0E39) __sfr RPINR30_31;
__at(0x0E39) volatile __RPINR30_31bits_t RPINR30_31bits;

__at(0x0E3A) __sfr RPINR32_33;
__at(0x0E3A) volatile __RPINR32_33bits_t RPINR32_33bits;

__at(0x0E3B) __sfr RPINR34_35;
__at(0x0E3B) volatile __RPINR34_35bits_t RPINR34_35bits;

__at(0x0E3C) __sfr RPINR36_37;
__at(0x0E3C) volatile __RPINR36_37bits_t RPINR36_37bits;

__at(0x0E3D) __sfr RPINR38_39;
__at(0x0E3D) volatile __RPINR38_39bits_t RPINR38_39bits;

__at(0x0E3E) __sfr RPINR40_41;
__at(0x0E3E) volatile __RPINR40_41bits_t RPINR40_41bits;

__at(0x0E3F) __sfr RPINR42_43;
__at(0x0E3F) volatile __RPINR42_43bits_t RPINR42_43bits;

